package Test;

public class Test5 {
    /*
    알고 있는 리눅스 명령어를 5개 이상 적고 각각에 대해 설명해보도록 하자 !
    cd : Change Directory 의 약자로 디렉토리의 위치를 바꾼다.
         cd .. 은 상위 디렉토리, cd 나 cd ~ 은 홈 디렉토리로 이동한다.
    pwd : 현재 위치의 경로를 보여준다.
    ls : list의 약자로 디렉토리의 목록을 보여준다.
         ls -l : 파일의 상세정보를 보여준다.
         ls -a : 숨김 파일도 모두 보여준다.
    mkdir : Make Directory의 약자로 디렉토리를 생성한다.
    cp : copy의 약자로 파일이나 디렉토리를 복사한다.
         cp -r [디렉토리 명] : 디렉토리 복사 시 -r 옵션을 넣는다.
    mv : move의 약자로 파일이나 디렉토리를 이동한다.
         이름 변경 기능도 있다.
    rm : remove의 약자로 파일이나 디렉토리를 삭제한다.
         rm -rf [디렉토리 명] : 디렉토리 삭제 시 -r 옵션을 넣는다.
         -f 옵션을 넣으면 삭제하기 전 재확인하지 않고 바로 삭제한다.
    chmod : Change Mode의 약자로 파일에 대한 권한을 변경한다.
            USER, GROUP, OTHER의 읽기, 쓰기, 실행 권한 변경이 가능하다.
    clear : 현재 행을 창의 최상단으로 위치하며 화면을 깨끗하게 만든다.
    ps -ef : 현재 실행중인 프로세스들을 보여준다.
    ifconfig : 네트워크 설정 정보를 확인한다.
    netstat : 네트워크 상태를 종합적으로 보여준다.
              netstat -ntlp : 현재 프로세스들이 사용중인 포트 번호를 보여준다.
    cat : 파일의 내용을 보여준다.
    grep : 파일 내에서 지정한 패턴(문자열)을 포함한 모든 행을 출력한다.
    history : 이전에 수행한 명령어 리스트를 보여준다.
    vi : vi 편집기를 사용한다.
         i : 현재 커서 앞에서 입력 모드 진입
         a : 현재 커서 뒤에서 입력 모드 진입
         o : 현재 커서 다음 줄에서 입력 모드 진입
         yy : 현재 줄 복사
         [숫자]yy : 입력한 행의 수만큼 복사
         p : 현재 커서 위치 아랫줄에 붙여넣기 / 삭제 후 복구
         dd : 현재 줄 삭제
         [숫자]dd : 입력한 행의 수만큼 삭제 (잘라내기와 같음)

         :q : 작업 후 저장하지 않고 vi 종료
         :wq : 작업 후 저장하고 vi 종료
         ! : 강제
     */
}
