package 정기역략평가01.Exercise20;

public class Randomteamstatement {
    // 현재 만들어 진 랜덤 팀 나누기는 A조 B조로 나누어 져있고 거기에 맞춰 팀을 나누게 되어 있다
    // 1.그렇기 때문에 나는 사람수와 나누고 싶은 팀의 갯수를 생성자에 넣을것이다
    // 2.랜덤 번호를 부여하여 중복 안되게 ArrayList로 add하기
    // 3.그리고 입력한 팀의 수로 나누어서 나머지가 있으면 사람 수 1명 추가하기
    // 4.위를 랜덤하게 정하기(이부분의 식은 머리에 안떠올릅니다)



    // 시간이 없어서 코딩은 못했습니다. 구상만 한번 생각해봤는데
    // 3번까지는 기존의 공부내용으로 하면 될것같은데
    // 4번 부분은 기존의 풀었던 방식과 다르게 해야 할 것 같은데
    // 이를 해결할 수 있는 방법을 생각해 내지 못했습니다


    // 코딩은 시간이 부족해서 하지 못했고 구상 방법만 기술 했습니다.

}
