package jan0112;

public class HomeworkInstruction {
    /*
이중 배열과 클래스를 활용한 연습 문제

1) 오늘 만든 Matrix 클래스를 개조하여
   사용자의 배열을 입력받아 행렬을 만들도록 개조해보자!
   실제 matlab의 풀 라이센스 가격은
   수십억 ~ 백억 이상 되는 소프트웨어다.
ex) numpy나 matlab이라는 파이썬 라이브러리
    혹은 소프트웨어에 존재하는 기능으로
    아래와 같은 것이 되게 만드는 것이다.

    int[] arr = {1, 2, 3, 4, 5, 6, 7, 8, 9};
    Matrix A = new Matrix(arr, 3, 3);
    혹은
    Matrix A = new Matrix(arr, 3);
    둘 다 동작이 되어야 할 것이다.

2) 행렬 두 개를 만들고 이 두 개의 행렬 덧셈을 수행하게 만들어보자!
   행렬의 차원은 편한대로 설정해도 무방하다.
   (오늘 만든 코드는 n by n 행렬도 가능하다)

3) 덧셈이 있다면 뺄셈도 있으니 뺄셈을 만들어보자!

4) 그렇다면 곱셈이 빠질 수 없으므로 곱셈도 만든다.

5) 나눗셈에 해당하는 역행렬을 구하는 것은
   사실 선형대수학의 행렬 판별식을 사용해야하므로 패스한다.
   만약 도전해 볼 사람은 한 번 도전해봐도 좋다.

   행렬의 판별식을 통해 역행렬을 판별하겠다면 위의 문제를 풀고
   저것이 어렵다면 9회차 4번 문제를
   이중 행렬을 사용하여 풀어보도록 합니다.
     */
}
