package FirstRegularTest;

public class Fifth {
    //알고 있는 리눅스 명령어를 5개 이상 적고 각각에 대해 설명해보도록 하자!
    /*
    ls : 현재 위치하고 있는 디렉토리에 있는 파일 목록을 보여주는 명령어
    pwd : 현재 내가 어디에 위치하고 있는지 경로 알려주는 명령어
    cd ~ : ~로 이동하라는 명령어
    cd .. : 바로 전 디렉토리로 이동하게 하는 명령어
    git status : 현재 git의 상태를 알려주는 명령어
    vi : 파일을 만들때 사용하는 명령어
    :wq : 내용을 저장하고 나가게하는 명령어
    :q : 저장하지 않고 그냥 나가는 명령어
    git remote -v : 현재 연결되어있는 깃허브 주소상황을 알려주는 명령어
    git commit -am : 변경된 사항을 깃허브에 커밋해주는 명령어
    git push origin main : 커밋된 내용을 연결되어있는 깃허브 origin에 올려주는 명령어
    rm : 파일을 삭제할 때 사용하는 명령어
    rm -rf : 디렉토리를 강제로 삭제하게 하는 명령어 끝에 f가 강제성을 가짐
    rmdir : 디렉토리 삭제 명령어
    mkdir : 현대위치에서 새로운 디렉토리를 생성하게 하는 명령어
    mv : 파일을 이동시킬떄 사용하는 명령어
    cat : vi를 입력하여 터미널 화면이 바뀌면서 내용을 입력하는 것이 아닌 보고있는 터미널
          화면에서 내용을 입력하여 파일을 만드는 것.
     */
}
